docs: Update README.md again
